[
  {
    "title": "CHOCOLATE CHIP MUFFINS",
    "id": "CHOCOLATE-CHIP-MUFFINS",
    "description": "Place the flour and caster sugar into a bowl and create a well in the middle for the other ingredients.Mix the eggs, vanilla extract...",
    "imagesSrc": [
      "https://www.littlesweetbaker.com/wp-content/uploads/2018/10/chocolate-chip-muffins-2.jpg",
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chocolate-chip-muffins-horizontal-bite-1545484055.png?crop=1xw:1xh;center,top&resize=768:*"
    ],
    "markdownSrc": "# CHOCOLATE CHIP MUFFINS\n![](IMAGE)\n\n- **Serves**:\t4-6\n- **Prep**: time\t10 minutes\n- **Cook**: time\t20 minutes\n- **Total**: time\t30 minutes\n- **Allergy**:\tEgg, Milk, Soy, Tree Nuts, Wheat\n- **Meal**: type\tDessert, Snack\n- **Misc**:\tChild Friendly, Serve Cold\n- **Region**\tEuropean\n\n## INGREDIENTS\n- 175g self-raising flour\n- 50g margarine\n- 50g caster sugar\n- 2 Medium eggs\n- 4 tablespoons milk\n- 1 teaspoon vanilla extract\n- 200g chocolate\n\n### Optional\n- sugar (a sprinkling for a crunchy top)\n\n![](IMAGE)\n\n## DIRECTIONS\n\n### Step 1\nPlace the flour and caster sugar into a bowl and create a well in the middle for the other ingredients.\nMix the eggs, vanilla extract, milk and margarine and then pour it into the bowl with the dry ingredients.\nMix well until it is lump free and then break the chocolate into small pieces and add them.\n\n### Step 2\nPour the muffin mixture into a muffin tin filling each mould up to two thirds full.\nPlace a block of chocolate into the middle of each muffin. Then sprinkle some sugar over the top of each.\n\n### Step 3\nCook for around 20 minutes in a preheated oven at 200ºC / 390ºF / gas mark 5. After 18 minutes or so check to see if they are cooked enough.\nInsert a knife into one of the muffins and if no mixture is on the knife then they are cooked!\nAllow to cool for at least 5 minutes before eating.\n\n## Source\n- [CHOCOLATE CHIP MUFFINS – EXAMPLE RECIPE](https://www.frenchranges.com/recipe/chocolate-chip-muffins-example-recipe/)",
    "type": "food"
  },
  {
    "title": "Chilli con carne",
    "id": "chilli-con-carne-recipe",
    "description": "This great chilli recipe has to be one of the best dishes to serve to friends for a casual get-together. An easy sharing favourite that uses up storecupboard ingredients.",
    "imagesSrc": [
      "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1001451_6-c8d72b8.jpg?resize=960,872?quality=90&webp=true&resize=300,272"
    ],
    "markdownSrc": "# Chilli Con Carne\n![](IMAGE)\n\n## Ingredients\n\n- 1 large onion\n- 1 red pepper\n- 2 garlic cloves\n- 1 tbsp oil\n- 1 heaped tsp hot chilli powder (or 1 level tbsp if you only have mild)\n- 1 tsp paprika\n- 1 tsp ground cumin\n- 500g lean minced beef\n- 1 beef stock cube\n- 400g can chopped tomatoes\n- ½ tsp dried marjoram\n- 1 tsp sugar (or add a thumbnail-sized piece of dark chocolate along with the beans instead, see tip)\n- 2 tbsp tomato purée\n- 410g can red kidney beans\n- plain boiled long grain rice, to serve\n- soured cream, to serve\n\n## Method\n**STEP 1**\n\nPrepare your vegetables. Chop 1 large onion into small dice, about 5mm square. The easiest way to do this is to cut the onion in half from root to tip, peel it and slice each half into thick matchsticks lengthways, not quite cutting all the way to the root end so they are still held together. Slice across the matchsticks into neat dice.\n\n**STEP 2**\n\nCut 1 red pepper in half lengthways, remove stalk and wash the seeds away, then chop. Peel and finely chop 2 garlic cloves.\n\n**STEP 3**\n\nStart cooking. Put your pan on the hob over a medium heat. Add 1 tbsp oil and leave it for 1-2 minutes until hot (a little longer for an electric hob).\n\n**STEP 4**\n\nAdd the onion and cook, stirring fairly frequently, for about 5 minutes, or until the onion is soft, squidgy and slightly translucent.\n\n**STEP 5**\n\nTip in the garlic, red pepper, 1 heaped tsp hot chilli powder or 1 level tbsp mild chilli powder, 1 tsp paprika and 1 tsp ground cumin.\n\n**STEP 6**\n\nGive it a good stir, then leave it to cook for another 5 minutes, stirring occasionally.\n\n**STEP 7**\n\nBrown 500g lean minced beef. Turn the heat up a bit, add the meat to the pan and break it up with your spoon or spatula. The mix should sizzle a bit when you add the mince.\n\n**STEP 8**\n\nKeep stirring and prodding for at least 5 minutes, until all the mince is in uniform, mince-sized lumps and there are no more pink bits. Make sure you keep the heat hot enough for the meat to fry and become brown, rather than just stew.\n\n**STEP 9**\n\nMake the sauce. Crumble 1 beef stock cube into 300ml hot water. Pour this into the pan with the mince mixture.\n\n**STEP 10**\n\nAdd a 400g can of chopped tomatoes. Tip in ½ tsp dried marjoram, 1 tsp sugar and add a good shake of salt and pepper. Squirt in about 2 tbsp tomato purée and stir the sauce well.\n\n**STEP 11**\n\nSimmer it gently. Bring the whole thing to the boil, give it a good stir and put a lid on the pan. Turn down the heat until it is gently bubbling and leave it for 20 minutes.\n\n**STEP 12**\n\nCheck on the pan occasionally to stir it and make sure the sauce doesn’t catch on the bottom of the pan or isn’t drying out. If it is, add a couple of tablespoons of water and make sure that the heat really is low enough. After simmering gently, the saucy mince mixture should look thick, moist and juicy.\n\n**STEP 13**\n\nDrain and rinse a 410g can of red kidney beans in a sieve and stir them into the chilli pot. Bring to the boil again, and gently bubble without the lid for another 10 minutes, adding a little more water if it looks too dry.\n\n**STEP 14**\n\nTaste a bit of the chilli and season. It will probably take a lot more seasoning than you think.\n\n**STEP 15**\n\nNow replace the lid, turn off the heat and leave your chilli to stand for 10 minutes before serving. This is really important as it allows the flavours to mingle.\n\n**STEP 16**\n\nServe with soured cream and plain boiled long grain rice.\n\n## Source\n- [Chilli con carne recipe](https://www.bbcgoodfood.com/recipes/chilli-con-carne-recipe)",
    "type": "food"
  },
  {
    "title": "Whiskey Sour",
    "id": "whiskey-sour",
    "description": "This is the cocktail that started it all. Here at A Couple Cooks, we’re cocktail obsessed. We have a myriad of cocktail recipes",
    "imagesSrc": [
      "https://www.acouplecooks.com/wp-content/uploads/2019/06/Whiskey-Sour-111.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2019/06/Whiskey-Sour-106.jpg"
    ],
    "markdownSrc": "# Best Whiskey Sour\n![](IMAGE)\n\n## Ingredients\n- 2 ounces (4 tablespoons) bourbon whiskey*\n- 1 ounce (2 tablespoons) fresh lemon juice\n- ¾ ounce (1 ½ tablespoons) pure maple syrup (or simple syrup)\n- Garnish: Orange peel and a cocktail cherry\n- Ice, for serving\n\n![](IMAGE)\n\n## Instructions\n1. Add the bourbon whiskey, lemon juice, and syrup to a cocktail shaker. Fill with a handful of ice and shake until very cold.\n2. Strain the drink into a lowball or Old Fashioned glass. Serve with ice, an orange peel and a cocktail cherry. \n\n## Source\n- [Best Whiskey Sour](https://www.acouplecooks.com/whiskey-sour/)\n",
    "type": "cocktail"
  },
  {
    "title": "Margarita",
    "id": "margarita",
    "description": "This popular Mexican cocktail was invented in the 1930s. It’s a classic sour cocktail that’s on the list of International Bartender Association’s IBA official cocktails.",
    "imagesSrc": [
      "https://www.acouplecooks.com/wp-content/uploads/2020/03/Margarita-025.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2020/02/Margarita-018.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2020/02/Margarita-015.jpg"
    ],
    "markdownSrc": "# Margarita\n![](IMAGE)\n\n## Ingredients\n- 1 ½ ounces (3 tablespoons) tequila blanco or reposado*\n- 1 ounce (2 tablespoons) Cointreau (or Triple Sec)\n- ¾ ounce (1 ½ tablespoons) fresh lime juice\n- Kosher salt or flaky sea salt, for the rim\n- For the garnish: Lime wedge\n\n![](IMAGE)\n\n## Instructions\n1. Cut a notch in a lime wedge, then run the lime around the rim of a glass. Dip the edge of the rim into a plate of salt (or for a festive look, use our Margarita Salt).\n2. Place all ingredients in a cocktail shaker with 4 ice cubes and shake until cold.\n3. Strain the margarita into the glass with the salted rim. Fill the glass with ice and serve.\n4. Pitcher (8 servings): Place 1 ½ cups tequila, 1 cup Cointreau or Triple Sec, and ¾ cup lime juice in a pitcher. Add 3 handfuls ice and stir until cold.\n\n![](IMAGE)\n\n## Source\n- [Best Simple Margarita (Classic Recipe!)](https://www.acouplecooks.com/classic-margarita/)\n",
    "type": "cocktail"
  },
  {
    "title": "Gin Fizz Cocktail",
    "id": "gin-fizz-cocktail",
    "description": "Looking for the best gin cocktail recipe? Try a refreshing Gin Fizz: it’s sweet, tangy, and has a frothy egg white foam topping.",
    "imagesSrc": [
      "https://www.acouplecooks.com/wp-content/uploads/2019/06/Gin-Fizz-102.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2019/06/Gin-Fizz-111.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2019/06/Gin-Fizz-108.jpg"
    ],
    "markdownSrc": "# Gin Fizz Cocktail\n\n![](IMAGE)\n\n## Ingredients\n- 2 ounces (4 tablespoons) gin\n- ¾ ounce (1 ½ tablespoons) lemon juice\n- ½ ounce (1 tablespoon) simple syrup or maple syrup\n- 1 egg white*\n- Garnish with lemon twist (optional)\n- Soda water\n\n![](IMAGE)\n\n## Instructions\n1. Place the gin, lemon juice, syrup and egg white in a cocktail shaker. Shake vigorously for 15 seconds.\n2. Fill the shaker with ice and shake for 30 seconds until cold.\n3. Strain the drink into a glass and top with the soda water; the egg white foam forms on top. If desired, garnish with a lemon twist. Serve immediately.\n\n## Source\n- [Gin Fizz Cocktail](https://www.acouplecooks.com/gin-fizz-cocktail/)\n",
    "type": "cocktail"
  },
  {
    "title": "The Classic Champagne Cocktail",
    "id": "champagne-cocktail",
    "description": "The Champagne Cocktail is a classic drink that’s festive and elegant, perfect for celebration (or New Year’s Eve). The sugar cube makes it sparkle!",
    "imagesSrc": [
      "https://www.acouplecooks.com/wp-content/uploads/2019/12/Champagne-Cocktail-006.jpg",
      "https://www.acouplecooks.com/wp-content/uploads/2019/12/Champagne-Cocktails-003.jpg"
    ],
    "markdownSrc": "# The Classic Champagne Cocktail\n![](IMAGE)\n\n## Ingredients\n- 1 sugar cube\n- 5 dashes Angostura bitters\n- Squeezed lemon peel\n- 1 glass champagne (10 tablespoons)*\n- For the garnish: Lemon twist\n\n![](IMAGE)\n\n## Instructions\n1. Make the lemon twist garnish, if using.\n2. Add a sugar cube to bottom of a champagne flute**. Add 5 dashes of bitters to the sugar cube. Use a vegetable peeler to peel off a small strip of lemon skin. Squeeze the lemon skin into the flute to release the oils.\n3. Fill the glass with champagne and serve immediately: watch how the sugar cube makes the bubbles sparkle! Garnish with a lemon twist if desired.\n\n## Source\n- [The Classic Champagne Cocktail](https://www.acouplecooks.com/the-classic-champagne-cocktail/)\n",
    "type": "cocktail"
  },
  {
    "title": "Elote Corn Soup",
    "id": "elote-corn-soup",
    "description": "Fresh and bright, this recipe transforms a classic Mexican street food, corn on the cob, into an irresistible bowl of soup. Chili spiced and lime spiked, these sweet and creamy bowls take the corn off the cob, turning it into the perfect summer starter or main.",
    "imagesSrc": [
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elote-mexican-corn-soup3-1657315925.jpg?resize=768:*",
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elote-mexican-corn-soup1-1657315817.jpg?crop=1.00xw:1.00xh;0,0&resize=980:*"
    ],
    "markdownSrc": "# Elote Corn Soup\n![](IMAGE)\n\n## INGREDIENTS\n- 3 tbsp. extra-virgin olive oil\n- 5 cloves garlic, minced\n- 6 c. corn kernels (from about 8 ears)\n- Kosher salt\n- 2 c. low-sodium chicken or vegetable broth\n- 1/2 tsp. chili powder\n- 1/2 tsp. dried oregano\n- 1/4 tsp. ground cumin\n- 2 tbsp. heavy cream\n- 1 tsp. finely grated lime zest, plus 4 tbsp. fresh lime juice, divided\n- 1/2 c. crumbled cotija cheese\n- 2 tbsp. finely chopped fresh cilantro leaves\n- Freshly ground black pepper\n- 1/3 c. Mexican crema or sour cream\n- Sweet paprika, for garnish\n- Sliced jalapeño, for garnish\n\n![](IMAGE)\n\n## DIRECTIONS\n1. Heat oil in a medium saucepan over medium-high. Add garlic and cook, stirring, until garlic is fragrant and light golden, 1 to 2 minutes. Add corn and ½ teaspoon salt and cook, stirring frequently, until corn is bright and crisp tender, about 3 minutes. Transfer 1½ cups of the corn to a medium heatproof bowl; set aside.\n2. Add broth, chili powder, oregano, cumin, and ¼ teaspoon salt to saucepan. Bring to a boil, then reduce heat to medium-low and simmer, partially covered, until corn is tender and flavors meld, about 10 minutes. Remove from the heat and let cool slightly.\n3. Working in batches, if necessary, transfer the soup to a blender and carefully puree until smooth, about 30 seconds. Return soup to pot and stir in heavy cream and 3 tablespoons lime juice. Rewarm soup over medium, if necessary, and season with salt and pepper to taste.\n4. Combine reserved corn mixture with lime zest, remaining 1 tablespoon lime juice, cotija, cilantro, and ¼ teaspoon each salt and pepper.\n5. Ladle soup into bowls and top with spoonfuls of corn mixture. Drizzle with crema, sprinkle with paprika, and top with jalapeño.\n\n## Source\n- [Elote Corn Soup](https://www.delish.com/cooking/recipe-ideas/a40512256/elote-corn-soup-recipe/)\n",
    "type": "food"
  },
  {
    "title": "Grilled Honey",
    "id": "grilled-honey",
    "description": "Grilling fish can be intimidating, but with foil packs, there's no need to stress. Rather than worry about the fish sticking to the grates or flipping the flaky flesh, you'll fold the salmon up in tin foil instead.",
    "imagesSrc": [
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/grilled-honey-chipotle-salmon-foil-packet-with-summer-squash3-1657291357.jpg?resize=768:*",
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/grilled-honey-chipotle-salmon-foil-packet-with-summer-squash1-1657290268.jpg?resize=980:*"
    ],
    "markdownSrc": "## Grilled Honey\nChipotle Salmon Foil Packets with Summer Squash\n![](IMAGE)\n\n## INGREDIENTS\n- 4 tbsp. butter, melted\n- 2 tbsp. honey\n- 1 tbsp. chipotle chili powder or regular chili powder\n- 3 cloves garlic, minced\n- Kosher salt\n- 4 (6-oz.) skin-on salmon filets\n- 1 medium zucchini, chopped\n- 1 summer squash, chopped\n- 1 small red onion, chopped\n- 1/4 c. packed basil leaves, torn\n- Lime wedges, for serving\n\n![](IMAGE)\n\n## DIRECTIONS\n- Heat grill to medium-high. In a small bowl, whisk butter, honey, chipotle chili powder, garlic, and ½ teaspoon salt; set aside.\n- Season both sides of salmon with ¾ teaspoon salt. In a medium bowl, toss zucchini, summer squash, and red onion with ¼ teaspoon salt.\n- Lay four 12”-by-16” pieces of foil on a flat surface. Divide vegetable mixture between foil packets, filling up half of the center of each piece of foil. Arrange salmon next to vegetables. Drizzle salmon and vegetables with the chipotle sauce (stir to combine before using if separated), dividing evenly. Fold and seal edges of foil to create a packet.\n- Grill, covered, until salmon is cooked through and squash is tender, rotating packets half way through, 11 to 14 minutes. Sprinkle with basil and serve with lime wedges.\n\n## Source\n- [Grilled Honey-Chipotle Salmon Foil Packets with Summer Squash](https://www.delish.com/cooking/recipe-ideas/a40511179/grilled-honey-chipotle-salmon-foil-packets-with-summer-squash/)\n",
    "type": "food"
  },
  {
    "title": "Prosecco Grapes",
    "id": "prosecco-gGrapes",
    "description": "Give grapes a festive upgrade!",
    "imagesSrc": [
      "https://hips.hearstapps.com/del.h-cdn.co/assets/18/09/1519937575-delish-prosecco-grapes.jpg?crop=1.0xw:1xh;center,top&resize=768:*"
    ],
    "markdownSrc": "# Prosecco Grapes\n![](IMAGE)\n\n## INGREDIENTS\n- 2 lb. green grapes\n- 1 (750-ml) bottle prosecco\n- 4 oz. vodka\n- 1/2 c. sugar\n\n## DIRECTIONS\n1. In a large bowl, pour prosecco and vodka over grapes. Let soak in fridge at least 1 hour.\n2. Drain grapes in a colander and pat dry, then transfer to a small baking sheet and pour sugar on top. Shake pan back and forth until grapes are fully coated in sugar.\n3. Serve in a bowl.\n\n## Source\n- [Prosecco Grapes](https://www.delish.com/cooking/recipe-ideas/recipes/a53420/prosecco-grapes-recipe/)\n",
    "type": "food"
  },
  {
    "title": "Lemon-Berry Firecracker Cake",
    "id": "lemon-berry-firecracker-cake",
    "description": "xxNothing says Fourth of July quite like a patriotic red, white, and blue dessert, especially this eye-popping lemon-berry firecracker cake.xxxxx",
    "imagesSrc": [
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lemon-berry-firecracker-cake3-1655473103.jpg?resize=768:*",
      "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lemon-berry-firecracker-cake1-1655472851.jpg?crop=1.00xw:1.00xh;0,0&resize=980:*"
    ],
    "markdownSrc": "# Lemon-Berry Firecracker Cake\n![](IMAGE)\n\n## INGREDIENTS\n- Cooking spray\n- 1 (15.25-oz.) box white cake mix\n- 1 (3.4-oz.) package instant lemon pudding mix\n- 4 large eggs\n- 1/2 c. vegetable oil\n- 1 c. plus 1 tbsp. (or more) lukewarm water\n- 1/4 c. raspberry jam\n- 7 (or more) drops red gel food coloring, divided\n- 1/4 c. blueberry jam\n- 7 (or more) drops blue gel food coloring, divided\n- 3 c. powdered sugar\n- 2 tbsp. fresh lemon juice\n- 1/4 c. red, white, and blue sprinkles\n\n![](IMAGE)\n\n## DIRECTIONS\n1. Preheat oven to 350º. Lightly coat a Bundt pan with cooking spray.\n2. In a large bowl, whisk cake mix and lemon pudding mix to combine. Add eggs, oil, and 1 cup lukewarm water. Using an electric mixer on medium-high speed, beat until smooth, about 1 minute.\n3. Scrape 1 cup lemon batter into a medium bowl. Stir raspberry jam and 5 drops red food coloring into batter until combined. Add more food coloring, a drop at a time, if a deeper red color is desired.\n4. Scrape another 1 cup lemon batter into another medium bowl. Stir blueberry jam and 5 drops blue food coloring into batter until combined. Add more food coloring, a drop at a time, if a deeper blue color is desired.\n5. Pour red batter into bottom of prepared pan. Pour remaining lemon batter over red batter. Pour blue batter over lemon batter.\n6. Bake until a tester inserted in center comes out clean, 40 to 45 minutes. Let cool in pan 15 minutes, then turn out onto a wire rack and let cool completely.\n7. Meanwhile, in a medium bowl, whisk powdered sugar, lemon juice, and 1 tablespoon lukewarm water, adding more water drop by drop if necessary, until thick and smooth and mixture is a lava-like consistency.\n8. Scoop a heaping 1/4 cup white glaze into a small bowl and stir in 2 drops red food coloring. Scoop another heaping 1/4 cup white glaze into another small bowl and stir in 2 drops blue food coloring.\n9. Drizzle white, then blue, then red glaze over cake. Scatter sprinkles over top. Let glaze set about 30 minutes before slicing.\n\n## Source\n- [Lemon-Berry Firecracker Cake(https://www.delish.com/cooking/recipe-ideas/a40253492/lemon-berry-firecracker-cake-recipe/)\n",
    "type": "food"
  }
]
